<?php

return [
    'app_name' => 'Менеджер задач',

    'login' => [
        'title' => 'Войти',
        'email' => 'Email',
        'password' => 'Пароль',
        'remember' => 'Запомнить меня',
        'forgot_password' => 'Забыли пароль?',
        'submit' => 'Войти',
        'error_header' => 'Упс! Что-то пошло не так:',
    ],

    'register' => [
        'title' => 'Регистрация',
        'name' => 'Имя',
        'email' => 'Email',
        'password' => 'Пароль',
        'confirmation' => 'Подтверждение',
        'already_registered' => 'Уже зарегистрированы?',
        'submit' => 'Зарегистрировать',
        'error_header' => 'Упс! Что-то пошло не так:',
    ],

    'reset_password' => [
        'title' => 'Сброс пароля',
        'email' => 'Email',
        'password' => 'Пароль',
        'confirm_password' => 'Подтвердите пароль',
        'submit' => 'Сбросить пароль',
    ],

    'forgot_password' => [
        'message' => 'Забыли свой пароль? Без проблем. Просто сообщите нам свой адрес электронной почты, и мы вышлем вам по электронной почте ссылку для сброса пароля, которая позволит вам выбрать новый.',
        'email' => 'Email',
        'submit' => 'Сбросить пароль',
    ],

    'verification' => [
        'message' => 'Спасибо за регистрацию! Прежде чем начать, подтвердите свой email, перейдя по ссылке в письме, которое мы вам отправили. Если вы не получили письмо, мы с радостью отправим вам новое.',
        'link_sent' => 'Новая ссылка для подтверждения была отправлена на указанный вами email.',
        'resend_button' => 'Отправить письмо повторно',
        'logout' => 'Выйти',
    ],

    'confirm_password' => [
        'message' => 'Это защищенная зона приложения. Пожалуйста, подтвердите ваш пароль перед продолжением.',
        'password' => 'Пароль',
        'submit' => 'Подтвердить',
    ],

    'failed' => 'Введите правильные имя пользователя и пароль',
];
